test/data/GetParameterValues.xml

<soap-env:Envelope 
    xmlns:soap-enc="http://schemas.xmlsoap.org/soap/encoding/" 
    xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:cwmp="urn:dslforum-org:cwmp-1-0"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema-instance">
    
  <soap-env:Header>
    <cwmp:ID mustUnderstand="1">42</cwmp:ID>
    <cwmp:NoMoreRequests>0</cwmp:NoMoreRequests>
  </soap-env:Header>
  <soap-env:Body>
    <cwmp:GetParameterValues>
      <cwmp:ParameterNames>
        <xsd:string>InternetGatewayDevice.DeviceInfo.SerialNumber</xsd:string>
        <xsd:string>InternetGatewayDevice.DeviceInfo.VendorConfigFile.</xsd:string>
      </cwmp:ParameterNames>
    </cwmp:GetParameterValues>
  </soap-env:Body>
</soap-env:Envelope>